import React, { useState, useEffect } from 'react';
import TestingPanel from './components/createTestingPanel';
import './keis-page.style.css';

// Компонент для рендеринга урока
function LessonPanel({ htmlContent, onComplete }) {
    return (
        <div className="lesson-panel">
            <div dangerouslySetInnerHTML={{ __html: htmlContent }}></div>
            <button onClick={onComplete}>Пометить как пройденое</button>
        </div>
    );
}



// Основной компонент курса
function KeisPage() {
    const data = courseData;
    const [completedLessons, setCompletedLessons] = useState([]);
    const [currentLesson, setCurrentLesson] = useState(null);
    const [testResults, setTestResults] = useState({});

    // Загрузка прогресса из localStorage
    useEffect(() => {
        const savedProgress = JSON.parse(localStorage.getItem('courseProgress' + data.id));
        if (savedProgress) {
            setCompletedLessons(savedProgress.completedLessons || []);
            setCurrentLesson(savedProgress.currentLesson || null);
            setTestResults(savedProgress.testResults || {});
        }
    }, []);

    // Сохранение прогресса в localStorage
    useEffect(() => {
        // Проверяем, что хотя бы одно из полей (completedLessons, currentLesson, testResults) не пустое
        if (completedLessons.length > 0 || currentLesson !== null || Object.keys(testResults).length > 0) {
            const progress = { completedLessons, currentLesson, testResults };
            localStorage.setItem('courseProgress' + data.id, JSON.stringify(progress));
        }
    }, [completedLessons, currentLesson, testResults]);

    const markAsCompleted = (id) => {
        if (!completedLessons.includes(id)) {
            setCompletedLessons([...completedLessons, id]);
        }
    };

    const handleLessonClick = (id) => {
        setCurrentLesson(id);
    };

    const handleCheckAnswers = (answers) => {
        const currentLessonData = data.modules
            .flatMap((module) => module.lessons)
            .find((lesson) => lesson.id === currentLesson);

        if (currentLessonData && currentLessonData.type === 'test') {
            // Здесь можно добавить логику проверки ответов
            const correctAnswers = {
                question1: 'Правильный ответ',
                question2: 'Правильный ответ',
            };

            let results = {};
            for (const [key, value] of Object.entries(answers)) {
                results[key] = value === correctAnswers[key];
            }

            setTestResults((prevResults) => ({
                ...prevResults,
                [currentLesson]: results,
            }));
        }
    };

    const totalLessons = data.modules.reduce((acc, module) => acc + module.lessons.length, 0);
    const completedPercentage = Math.round((completedLessons.length / totalLessons) * 100);

    const currentLessonData = data.modules
        .flatMap((module) => module.lessons)
        .find((lesson) => lesson.id === currentLesson);


    return (
        <div className="keis-page">

        <div className="buttons-achiev">
          <button className="secondary-btn_course"><a href="about">Мои курсы</a></button>
          <button className="secondary-btn_achieven"> <a href="/register">Мои достижения</a></button>
        </div>

            <div className="course-content">
                <div className="sidebar">
                    <h1>{data.title}</h1>
                    <p>Progress: {completedPercentage}%</p>
                    {data.modules.map((module) => (
                        <div key={module.id} className="module">
                            <h2>• {module.title}</h2>
                            {module.lessons.map((lesson) => (
                                <div key={lesson.id} className="lesson-or-test">
                                    <h3 onClick={() => handleLessonClick(lesson.id)} style={{ cursor: 'pointer' }}>
                                        {lesson.title} {completedLessons.includes(lesson.id) && ' (Пройдено)'}
                                    </h3>
                                </div>
                            ))}
                        </div>
                    ))}
                </div>
                <div className="main-content">
                    {currentLessonData ? (
                        currentLessonData.type === 'lesson' ? (
                            <LessonPanel
                                htmlContent={currentLessonData.data}
                                onComplete={() => markAsCompleted(currentLessonData.id)}
                            />
                        ) : (
                            <TestingPanel
                                title={currentLessonData.title}
                                testData={currentLessonData.questions}
                                onComplete={() => markAsCompleted(currentLessonData.id)}
                            />
                        )
                    ) : (
                        <p>Please select a lesson or test from the left.</p>
                    )}
                </div>
            </div>
        </div>
    );
}

// Пример данных курса
const courseData = {
    id: 0,
    title: 'Социальная инженерия',
    modules: [
        {
            id: 1,
            title: 'Модуль 1. Вводная часть',
            lessons: [
                {
                    id: 20,
                    title: 'Модуль 1. Вводная часть',
                    type: 'lesson',
                    data: '<h3>Занятие 1. Обзор программы кейса</h3><p>Добро пожаловать на курс по социальной инженерии, на данном курсе будут разобраны основные моменты данной атаки, а также все её виды с подробными примерами того, как мошенник может обмануть тебя. </p><p>За время учёбы ты также познакомишься или закрепишь знания по финансовой грамотности, а также узнаешь больше про понятие финансовой пирамиды.</p><p>В конце курса ты пройдёшь итоговое тестирование и закрепишь полученные знания. Благодаря полученным знаниям ты сможешь эффективнее противостоять мошенникам в интернете и по телефону и сможешь не беспокоиться о своём кошельке.</p><p>Курс предназначен для всех возрастов с различным уровнем знаний в данной области информационной безопасности и несёт в себе сугубо ознакомительный характер. </p><p>Все приведённые примеры и разбор каждого метода социальной инженерии не призывает кого‑либо идти и совершать противоправные действия и применять их на практике во вред другим людям. </p><p>Кейс создан с целью повысить знания или закрепить их в области социальной инженерии. Всего в курсе 12 занятий, длительностью около 10–15 минут, в конце всего кейса тебя ждёт итоговое тестирование после которого кейс считается заершенным.</p>',
                },
                
            ],
        },
        {
            id: 2,
            title: 'Модуль 2. Финансовое поведение',
            lessons: [
                {
                    id: 3,
                    title: 'Занятие 1. Финансовая грамотность',
                    type: 'lesson',
                    data: '<h3>Занятие 1. Финансовая грамотность</h3><p>Финансовая грамотность - это умение управлять своими финансами эффективно и ответственно. Она включает в себя знание основных финансовых понятий, умение составлять бюджет, планировать расходы, управлять долгами, инвестировать и планировать на пенсию. Финансовая грамотность помогает людям принимать осознанные финансовые решения, избегать долговой ямы, создавать финансовую стабильность и строить благополучное будущее. Обучение финансовой грамотности важно для всех, независимо от возраста или дохода, и может помочь достичь финансового благополучия и независимости.</p><p>Существует несколько основных видов финансовой грамотности, которые включают в себя:<p>1. Бюджетирование и планирование - умение составлять бюджет, определять свои доходы и расходы, планировать финансовые цели и следить за своими финансами.</p><p>2. Управление долгами - понимание различных видов долгов, умение эффективно управлять кредитами, минимизировать долговую нагрузку и избегать долговой ямы.</p><p>3. Инвестирование - знание основ инвестирования, различных видов инвестиций, рисков и доходности, умение принимать обоснованные инвестиционные решения.</p><p>4. Страхование - понимание роли страхования в финансовом планировании, выбор подходящих видов страхования для защиты себя и своих финансов.Планирование на пенсию - умение планировать и накапливать средства на пенсию, выбирать подходящие пенсионные схемы и инвестировать для обеспечения финансовой стабильности в пожилом возрасте.</p><p>Эти виды финансовой грамотности важны для обеспечения финансового благополучия и успешного управления личными финансами.</p>',
                },
                {
                    id: 4,
                    title: 'Занятие 2. Планирование и учёт',
                    type: 'lesson',
                    data: '<h3>Занятие 2. Планирование и учёт</h3><p>Планирование и учет играют ключевую роль в финансовой грамотности и управлении личными финансами. Вот некоторые аспекты планирования и учета:</p><p>1. Планирование бюджета: Планирование бюджета включает в себя определение своих доходов и расходов, установление финансовых целей и разработку плана действий для достижения этих целей. Бюджет помогает контролировать расходы, избегать излишних трат и эффективно управлять финансами.</p><p>2. Учет финансов: Ведение учета финансов позволяет отслеживать свои доходы и расходы, анализировать свои финансовые привычки, выявлять потенциальные проблемы и принимать обоснованные финансовые решения. Существуют различные способы ведения учета, от использования таблиц Excel до специализированных финансовых приложений.</p><p>3. Планирование на долгосрочную перспективу: Планирование на долгосрочную перспективу включает в себя установление долгосрочных финансовых целей, таких как покупка жилья, образование детей, пенсионное обеспечение. Планирование на долгосрочную перспективу помогает создать финансовую стабильность и обеспечить благополучное будущее.</p><p>4. Анализ и корректировка планов: Важной частью планирования и учета является анализ финансовых результатов, выявление проблемных областей и корректировка финансовых планов в соответствии с изменяющимися обстоятельствами.</p><p>Планирование и учет помогают людям принимать осознанные финансовые решения, контролировать свои финансы и строить финансовое благополучие в долгосрочной перспективе.</p>',
                },
                {
                    id: 5,
                    title: 'Занятие 3. Пассивный и активный источник дохода',
                    type: 'lesson',
                    data: '<h3>Занятие 3. Пассивный и активный источник дохода</h3><p>Пассивный и активный источники дохода - это два основных типа дохода, которые могут быть получены людьми. Вот их краткое описание:</p><p>1. Описание: Активный доход - это доход, который получается в результате активной работы или участия в процессе заработка. Это может быть заработная плата за работу, комиссионные, гонорары, доход от бизнеса, который требует активного участия и усилий для его получения.</p><p>Примеры: Заработная плата, доход от фриланса, доход от бизнеса, комиссионные, гонорары за услуги.</p><p>2. Пассивный источник дохода:Описание: Пассивный доход - это доход, который получается без необходимости активного участия или усилий со стороны получателя дохода. Это доход, который поступает регулярно, даже когда человек не работает напрямую. Пассивный доход может быть результатом инвестиций, аренды, авторских прав, роялти и других источников.</p><p>Примеры: Доход от аренды недвижимости, дивиденды от инвестиций, доход от авторских прав, роялти от книг или музыки.</p><p>Оба типа дохода имеют свои преимущества и недостатки. Активный доход обычно требует постоянного участия и усилий, но может быть более надежным и предсказуемым. Пассивный доход, с другой стороны, может обеспечить финансовую стабильность и свободу, но может потребовать времени и усилий для его создания. Многие люди стремятся к созданию пассивных источников дохода для обеспечения финансовой независимости и увеличения своего дохода.</p>',
                },
            ],
        },
        {
            id: 3,
            title: 'Модуль 3. Введение в социальную инженерию',
            lessons: [
                {
                    id: 6,
                    title: 'Занятие 1. Социальная инженерия',
                    type: 'lesson',
                    data: '<h3>Занятие 1. Социальная инженерия</h3><p>Социальная инженерия - это метод манипуляции людьми с целью получения конфиденциальной информации или выполнения определенных действий. Этот метод часто используется хакерами и мошенниками для обмана людей и получения доступа к защищенным данным или системам.</p><p>Примеры социальной инженерии могут включать в себя звонки или электронные письма, в которых злоумышленник представляется сотрудником компании или другим доверенным лицом и запрашивает у потенциальной жертвы конфиденциальную информацию, такую как пароли, данные банковских счетов или доступ к компьютерной системе.</p><p>Существует несколько основных видов социальной инженерии, которые могут быть использованы для манипуляции людьми и получения конфиденциальной информации. Вот некоторые из них:</p><p>1. Фишинг.</p><p>2. Претекстинг.</p><p>3. Троянский конь</p><p>4. Quid pro quo (услуга за услугу).</p><p>5. Дорожное яблоко.</p><p>6. Обратная социальная инженерия.</p>',
                },
                {
                    id: 7,
                    title: 'Занятие 2. Претексинг',
                    type: 'lesson',
                    data: '<h3>Занятие 2. Претексинг</h3><img width="1000px" src="https://i.ytimg.com/vi/Xy0_faJFYIQ/maxresdefault.jpg"><p>Ссылка: https://clck.ru/3BdZSs</p><p>Претекстинг  – это действия, характеризующиеся, что злоумышленник по заранее составленному и отработанному сценарию заставляет свою жертву выдать какую-либо информацию или совершить определенное действие.</p>Такой вид атак применяется преимущественно по телефону, чтобы застать жертву врасплох и чтобы не смогла предпринять никакие действия, кроме как содействия злоумышленнику. Иначе говоря, злоумышленник нагромождает свою беседу с жертвой диалогами, которые поспособствуют доверию со стороны цели, например, персонализации: выяснение имени сотрудника, занимаемой им должности и названия проектов, над которыми он работает.<p></p><p>Такой вид атак применяется преимущественно по телефону, чтобы застать жертву врасплох и чтобы не смогла предпринять никакие действия, кроме как содействия злоумышленнику. Иначе говоря, злоумышленник нагромождает свою беседу с жертвой диалогами, которые поспособствуют доверию со стороны цели, например, персонализации: выяснение имени сотрудника, занимаемой им должности и названия проектов, над которыми он работает. </p><p>Этот метод может быть использован, для того чтобы раскрыть информацию о клиентах, получить записи телефонных разговоров, или полезные данные, банковские отчеты и другую информацию, которой обладает сотрудник компании. </p>',
                },
                {
                    id: 8,
                    title: 'Занятие 3. Фишинг',
                    type: 'lesson',
                    data: '<h3>Занятие 3. Фишинг</h3><img width="1000px" src="https://www.cioinsight.com/wp-content/uploads/2021/12/Malware-vs-Viruses-What-are-the-Differences.png"><p>Фишинг, он представляет собой метод получения информации обманным путем или жульничество. Обычно такой метод используется в  e-mail сообщениях, злоумышленник подделывает его под  официальное письмо, например, от банка или платёжной системы для проверки некой информации или странную активность. Такое письмо содержит ссылку на фальшивую web-страницу, полностью имитирующую официальную, где необходимо ввести конфиденциальную информацию, адрес или пин-код банковской карты</p>',
                },
                {
                    id: 9,
                    title: 'Занятие 4. Троянский конь',
                    type: 'lesson',
                    data: '<h3>Занятие 4. Троянский конь</h3> <p>Троянский конь, данный вид атаки основывается на любопытстве, страхах или алчности пользователя, то есть на низменных человеческих эмоциях, которые и способствуют утечке информации. Данный вид атаки также проделывается через электронную почту. Преступник отправляет письмо жертве на электронный ящик, во вложении которого находится обновления антивируса или подарок от известной компании, или даже компромат на сотрудника. </p> <p>Пример спам-рассылки на получение выигрыша:</p> <img src="https://helpantivirus.ru/wp-content/uploads/2021/04/https-www-orgpage-ru-media-uploaded-220401934-jp.jpeg"> ',
                },
                {
                    id: 10,
                    title: 'Занятие 5. Услуга за услугу',
                    type: 'lesson',
                    data: '<h3>Занятие 5. Услуга за услугу</h3> <img src="https://sun9-17.userapi.com/impg/kI9yJ7Ajuw-54DJl3pB5lTZkEqBIfHn8F-OD-g/ok2tdeFWM0w.jpg?size=803x203&quality=96&sign=ee523b15cd8f992b9db469431b19adb6&type=album"> <p>Пример метода Quid pro quo.</p> <p>Quid pro quo (услуга за услугу), еще один вид атаки, который предполагает, что пользователь или сотрудник под руководством злоумышленника совершает определенные действия, способствующие  заражению компьютера жертвы. </p>',
                },
                {
                    id: 11,
                    title: 'Занятие 6. Дорожное яблоко',
                    type: 'lesson',
                    data: '<h3>Занятие 6. Дорожное яблоко</h3> <p>Дорожное яблоко – метод, представляющий собой адаптацию троянского коня, состоит в использовании физических носителей (CD, флэш-накопителей). Происходит это так, злоумышленник подбрасывает носитель в общедоступные места на территории компании для того чтобы его смогли быстро найти либо сотрудники компании, либо просто «добрый самаритянин» отнесет диск в компанию. Сам носитель подделывается под официальный, наносится логотип и соответствующая подпись, которая вызовет любопытство. </p> <p>Например, Преступник подбрасывает CD, с логотипом и надписью «Заработная плата руководящего состава Q1 2007»[7]. Диск якобы оставит случайно на полу лифта, или в вестибюле, сотрудник, нашедший этот диск и по незнанию вставить его в компьютер, чтобы удовлетворить своё любопытство и все, произошло заражение компьютера. </p>',
                },
                {
                    id: 12,
                    title: 'Занятие 7. Обратная социальная инженерия',
                    type: 'lesson',
                    data: '<h3>Занятие 7. Обратная социальная инженерия</h3><p>Обратная социальная инженерия – вид атаки, который направлен на создание ситуации, когда жертва вынуждена сама обратиться к злоумышленнику. </p> <p>Чтобы понимать данный вид атаки лучше, предположим такой пример, злоумышленник высылает письмо с рекламой якобы службы поддержки и оставляет контактные данные и через некоторое время создает обратимые неполадки в компьютере жертвы. Поломка происходит из-за заранее зараженного программного обеспечения, которое пользователь мог по неосторожности загрузить на свой компьютер. Пользователь, которому необходимо срочно работать на своем компьютере захочет быстро устранить данную проблему и позвонит преступнику сам по указанному номеру из рекламы. В процессе диалога преступник сможет получить необходимые ему данные</p>',
                },
                {
                    id: 13,
                    title: 'Занятие 8. Финансовые пирамиды',
                    type: 'lesson',
                    data: '<h3>Занятие 8. Финансовые пирамиды</h3> <img width="1000px" src="https://life.akbars.ru/upload/iblock/3a9/ymdzt5245lmzg5hq4shedyc9s7p5vn6s.png"> <p>Финансовая пирамида - это вид мошенничества, при котором участники привлекаются к инвестированию средств с обещанием высоких доходов, но фактически доходы выплачиваются за счет взносов новых участников, а не за счет реальной прибыли от инвестиций или продуктивной деятельности. Это незаконная схема обогащения, которая обычно обречена на крах, когда приток новых участников прекращается, и система не может обеспечить выплаты всем участникам. </p>',
                },

                {
                    id: 14,
                    title: 'Контрольные вопросы по социальной инженерии',
                    type: 'test',
                    questions: [
                        {
                            question: 'Что такое социальная инженерия?',
                            options: [
                                'Это метод атак, который направлен на разглашение конфиденциальной информации путем психологического манипулирования пользователем',
                                'Это методы защиты, направленные на предотвращение от несанкционированного вмешательства мошенников запоминает своё лексическое окружение',
                                'Это методы, основанные на взаимодействии всех слоев населения их привычек и других признаков, для поддержания баланса и качества обслуживания в крупных корпорациях циклов в JavaScript'
                            ],
                            correctAnswer: 'Это метод атак, который направлен на разглашение конфиденциальной информации путем психологического манипулирования пользователем'
                        },
                        {
                            question: 'Представьте, что вы хотите взять кредит в долг 100 000 рублей. Первый банк вам предложил деньги на условиях, вы вернете банку через год 125 000, второй же предложил вам вернуть 100 000 рублей под 20% от суммы долга. Какой из предложений выгоднее?',
                            options: [
                                'Первое',
                                'Второе',
                                'Одинаковы'
                            ],
                            correctAnswer: 'Второе'
                        },
                        {
                            question: 'Вам пишет друг с просьбой занять денег на несколько дней, ваши действия?',
                            options: [
                                'Займу, ведь это мой друг, а друзьям необходимо помогать в любой ситуации',
                                'Я займу, но когда буду убежден, что именно он пишет мне с этой просьбой, попрошу написать голосовое сообщение или позвоню ему лично',
                                'Я не знаю'
                            ],
                            correctAnswer: 'Я займу, но когда буду убежден, что именно он пишет мне с этой просьбой, попрошу написать голосовое сообщение или позвоню ему лично'
                        },
                        {
                            question: 'Что такое реферальная ссылка?',
                            options: [
                                'Это ссылка на определенный интернет-ресурс, которая содержит уникальный идентификатор партнера, для получения процента от перешедшего по ней ',
                                'Это ссылка на определенный интернет-ресурс, которая содержит информацию о партнере, для получения дополнительного заработка',
                                'Это ссылка для привлечения новых клиентов путем предоставления скидок и других акционных предложений'
                            ],
                            correctAnswer: 'Это ссылка на определенный интернет-ресурс, которая содержит уникальный идентификатор партнера, для получения процента от перешедшего по ней '
                        },
                        {
                            question: 'Что такое обратная социальная инженерия?',
                            options: [
                                'Вид защиты, который помогает предотвратить кражу данных и несанкционированный доступ к ресурсам компании',
                                'Вид атаки, который направлен на создание ситуации, когда жертва вынуждена сама обратиться к злоумышленнику',
                                'Не знаю что это такое'
                            ],
                            correctAnswer: 'Вид атаки, который направлен на создание ситуации, когда жертва вынуждена сама обратиться к злоумышленнику'
                        },
                        {
                            question: 'Вам приходит в Инстаграм сообщение, что проходит акция от американской компании и вы можете испытать удачу и вывести 100$ на счет, но перед этим вам необходимо внести организационный взнос, ваши действия?',
                            options: [
                                'Попробую внести этот взнос, если что-то пойдет не так, то что же поделать, а если сработает, то это же прекрасно',
                                'Не стану этого делать, потому что это мошенничество, ни одна официальная организация не будет требовать от меня взнос для того чтобы провести мне транзакцию',
                                'Сначала я прочитаю отзывы, чтобы убедиться, что это не мошенничество и тогда выведу деньги'
                            ],
                            correctAnswer: 'Не стану этого делать, потому что это мошенничество, ни одна официальная организация не будет требовать от меня взнос для того чтобы провести мне транзакцию'
                        }
                    ]
                
                },
            ],
        },
    ],
};

export default KeisPage;
